# import neccessary libraries

In [1]:
import re
import string
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
from tensorflow.keras.utils import to_categorical
from sklearn.model_selection import train_test_split
import text_hammer as th
import os

# removing emails, links, special characters and accenated chars for text preprocessing

In [2]:
def text_clean(df,col_name):
    column=col_name
    df[column]=df[column].apply(lambda x:th.remove_emails(x))
    df[column]=df[column].apply(lambda x:th.remove_html_tags(x))
    df[column]=df[column].apply(lambda x:th.remove_special_chars(x))
    df[column]=df[column].apply(lambda x:th.remove_accented_chars(x))
    return df

# mapping each class to it's numerical index

In [3]:
def class_to_index(y):
    label_dict={}
    labels=y.unique()
    for index, possible_label in enumerate(labels):
        label_dict[possible_label] = index
    print(label_dict)
    return label_dict

In [4]:
def replacing_class_with_index(df,label):
    
    label_dict=class_to_index(df[label])
    df[label]=df[label].replace(label_dict)
    return df

# loading dataset

In [6]:
df_train = pd.read_csv(r"C:\Users\ahmed hatem\Downloads\BBC News Train.csv\BBC News Train.csv")
df_test = pd.read_csv(r"C:\Users\ahmed hatem\Downloads\BBC News Test.csv\BBC News Test.csv")

In [7]:
df_test

     ArticleId                                               Text
0         1018  qpr keeper day heads for preston queens park r...
1         1319  software watching while you work software that...
2         1138  d arcy injury adds to ireland woe gordon d arc...
3          459  india s reliance family feud heats up the ongo...
4         1020  boro suffer morrison injury blow middlesbrough...
..         ...                                                ...
730       1923  eu to probe alitalia  state aid  the european ...
731        373  u2 to play at grammy awards show irish rock ba...
732       1704  sport betting rules in spotlight a group of mp...
733        206  alfa romeos  to get gm engines  fiat is to sto...
734        471  citizenship event for 18s touted citizenship c...

[735 rows x 2 columns]

# applying text cleaning

In [8]:
df_train=text_clean(df_train,'Text')
df_test=text_clean(df_test,'Text')

# applying target preprocessing

In [9]:
df_train=replacing_class_with_index(df_train,'Category')

{'business': 0, 'tech': 1, 'politics': 2, 'sport': 3, 'entertainment': 4}

# splitting the data again into train,test and validate

In [19]:
X_train, X_val, y_train, y_val = train_test_split(df_train['Text'], df_train['Category'], test_size=0.4)

In [20]:
train=pd.merge(X_train,pd.DataFrame(y_train),right_index=True,left_index=True)
validate=pd.merge(X_val,pd.DataFrame(y_val),right_index=True,left_index=True)

In [21]:
train

                                                   Text  Category
321   nasdaq planning 100m share sale the owner of t...         0
171   spirit awards hail sideways the comedy sideway...         4
1455  britons fed up with net service a survey condu...         1
184   businesses fail to plan for hiv companies fail...         0
234   ray charles studio becomes museum a museum ded...         4
...                                                 ...       ...
854   bbc web search aids odd queries the bbc s onli...         1
492   row threatens hendrix museum plan proposals to...         4
410   troubled marsh under sec scrutiny the us stock...         0
1065  jobs growth still slow in the us the us create...         0
748   martinez sees off vinci challenge veteran span...         3

[894 rows x 2 columns]

In [22]:
validate

                                                   Text  Category
669   mansfield 01 leyton orient an secondhalf goal ...         3
1483  beastie boys win sampling battle us rappers be...         4
74    gebrselassie in london triple bid double olymp...         3
485   tmobile bets on pocket office tmobile has laun...         1
1263  gronkjaer agrees switch to madrid jesper gronk...         3
...                                                 ...       ...
386   robots learn robotiquette rules robots are lea...         1
1447  us prepares for hybrid onslaught sales of hybr...         0
886   winndixie files for bankruptcy us supermarket ...         0
1071  bbc should allow more scrutiny mps have urged ...         4
243   ireland 1712 south africa ronan o gara scored ...         3

[596 rows x 2 columns]

In [23]:
train.to_csv('train1.csv')

In [24]:
validate.to_csv('validate1.csv')

In [25]:
df_test.to_csv('test1.csv')